# Крестики-нолики на Python

# ====================================== Переменные ==============================================

# Количество клеток
board_size = 3

# Игровое поле
board = [1, 2, 3, 4, 5, 6, 7, 8, 9]

# ====================================== Функции ==============================================

def draw_board():
    # выводим игровое поле
    print('_' * 4 * board_size)
    for i in range(board_size):
        print((' ' * 3 + '|') * 3)
        print('', board[i * 3], '|', board[1 + i * 3], '|', board[2 + i * 3], '|')
        print(('_' * 3 + '|') * 3)

def game_step():
    # Выполняем ход
    pass

def check_win():
    # Определяем победителя
    pass

def start_game():
    # Текущий игрок
    current_player = 'X'
    # Номер шага
    step = 1
    # Вызываем по очереди все функции
    draw_board()

print('Добро пожаловать в Крестики-нолики!')

# Вызов функции
start_game()